//
//  Native Build System properties for the iOS platform
//  English localization
//

"Name" = "Standard Build Settings";
"Description" = "General";


// Deployment Settings

"[Deployment]-category" = "Deployment";

"[IPHONEOS_DEPLOYMENT_TARGET]-name" = "iOS Deployment Target";
"[IPHONEOS_DEPLOYMENT_TARGET]-description" = "Code will load on this and later versions of iOS.  Framework APIs that are unavailable in earlier versions will be weak-linked; your code should check for null function pointers or specific system versions before calling newer APIs. [IPHONEOS_DEPLOYMENT_TARGET]

iOS 4.3 - Code will not load on systems earlier than 4.3. [4.3]
iOS 5.0 - Code will not load on systems earlier than 5.0. [5.0]
iOS 5.1 - Code will not load on systems earlier than 5.1. [5.1]
iOS 6.0 - Code will not load on systems earlier than 6.0. [6.0]
iOS 6.1 - Code will not load on systems earlier than 6.1. [6.1]
iOS 7.0 - Code will not load on systems earlier than 7.0. [7.0]
iOS 7.1 - Code will not load on systems earlier than 7.1. [7.1]
iOS 8.0 - Code will not load on systems earlier than 8.0. [8.0]
iOS 8.1 - Code will not load on systems earlier than 8.1. [8.1]
iOS 8.2 - Code will not load on systems earlier than 8.2. [8.2]
iOS 8.4 - Code will not load on systems earlier than 8.4. [8.4]

";
// Supported IPHONEOS_DEPLOYMENT_TARGETs 
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[4.3]" = "iOS 4.3";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[4.3]" = "Code will not load on systems earlier than 4.3. [4.3]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[5.0]" = "iOS 5.0";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[5.0]" = "Code will not load on systems earlier than 5.0. [5.0]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[5.1]" = "iOS 5.1";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[5.1]" = "Code will not load on systems earlier than 5.1. [5.1]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[6.0]" = "iOS 6.0";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[6.0]" = "Code will not load on systems earlier than 6.0. [6.0]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[6.1]" = "iOS 6.1";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[6.1]" = "Code will not load on systems earlier than 6.1. [6.1]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[7.0]" = "iOS 7.0";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[7.0]" = "Code will not load on systems earlier than 7.0. [7.0]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[7.1]" = "iOS 7.1";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[7.1]" = "Code will not load on systems earlier than 7.1. [7.1]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[8.0]" = "iOS 8.0";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[8.0]" = "Code will not load on systems earlier than 8.0. [8.0]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[8.1]" = "iOS 8.1";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[8.1]" = "Code will not load on systems earlier than 8.1. [8.1]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[8.2]" = "iOS 8.2";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[8.2]" = "Code will not load on systems earlier than 8.2. [8.2]";
"[IPHONEOS_DEPLOYMENT_TARGET]-value-[8.4]" = "iOS 8.4";
"[IPHONEOS_DEPLOYMENT_TARGET]-description-[8.4]" = "Code will not load on systems earlier than 8.4. [8.4]";



// Linking Settings

"[Linking]-category" = "Linking";

"[LD_NO_PIE]-name" = "Don't Create Position Independent Executables";
"[LD_NO_PIE]-description" = "Activating this setting will cause Xcode to not create position independent executables.  [LD_NO_PIE, -no_pie]";


// Code Signing Settings

"[Code Signing]-category" = "Code Signing";

// we hide this from the UI
//"[PROVISIONING_PROFILE]-name" = "Code Signing Provisioning Profile";
//"[PROVISIONING_PROFILE]-description" = "The profile to embed in the build product during code signing.  This must correspond to the code signing identity.  [PROVISIONING_PROFILE]";
